DataProcessors/Ошибка.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<DataProcessor>
		<Properties>
			<Name>Ошибка</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Стр</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтрФрмт</Name>
					<Type>
						<v8:Type>v8ui:FormattedString</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтрБезФрмт</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

DataProcessors/Ошибка/Forms/Форма/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Заголовок = Параметры.Заголовок;
	
	Если ТипЗнч(Параметры.Стр) = Тип("ФорматированнаяСтрока") Тогда
		Объект.СтрФрмт = Параметры.Стр;	  
		Попытка
			Объект.СтрБезФрмт = Параметры.Стр.ПолучитьТекст();  
		Исключение
		    Объект.СтрБезФрмт = Параметры.Стр;
		КонецПопытки;
	Иначе
		Объект.СтрФрмт = Новый ФорматированнаяСтрока(ОбщегоНазначенияСервер.ТекстHTMLВФорматированнуюСтроку(омСервер.Фрмт(Параметры.Стр, "КРАСНЫЙ_ТЕКСТ")));	
		Объект.СтрБезФрмт = Параметры.Стр;
	КонецЕсли;	
	
	Если Параметры.Свойство("Таймаут") Тогда
		Отсчет = Параметры.Таймаут;
	КонецЕсли;                 

КонецПроцедуры

&НаКлиенте
Процедура ЗаморозитьФорму()
	
	Если Отсчет > 0 Тогда
		Элементы.ОК.Заголовок = СтрШаблон("%1 (%2)", "ОК", Отсчет);
		Элементы.ОК.Доступность = Ложь;
		Отсчет = Отсчет - 1;
	Иначе
		Элементы.ОК.Заголовок = "ОК";
		Элементы.ОК.Доступность = Истина;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Элементы.СтрБезФрмт.Видимость = Ложь;

	Если Отсчет > 0 Тогда 
		Элементы.ОК.Доступность = Ложь;
		ПодключитьОбработчикОжидания("ЗаморозитьФорму", 1, Ложь)	
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ОформлениеПриИзменении(Элемент)

	Элементы.СтрФрмт.Видимость = НЕ	Элементы.СтрФрмт.Видимость;
	Элементы.СтрБезФрмт.Видимость = НЕ	Элементы.СтрБезФрмт.Видимость;

КонецПроцедуры
